# Pandas

THis notebook records notes for the Pandas library

In [1]:
import pandas as pd
import numpy as np

# Scenarios and Use Cases

## Create dataframe

Create a dataframe of random integers

In [2]:
df = pd.DataFrame(np.random.randint(0,100,size=(10, 4)), columns=list('ABCD'))
df

    A   B   C   D
0  78  72  80  55
1   8  36  26   0
2  81  78   2  51
3  16  31  33  73
4   0  56  16  59
5  71  18  46  74
6  12  30  86  81
7  93  14  26  14
8  32  75  53  59
9  57   2  22  55

## .loc : slicing the dataframe

use .loc to select both rows and columns by label based indexing. The labels being the values of the index or the columns. Slicing with .loc includes the last element.

In [3]:
df = pd.DataFrame(np.random.randint(0,100,size=(10, 4)), columns=list('ABCD'))
df.loc[3:9:2, 'B':]

    B   C   D
3  48  89  78
5  61  42  57
7  40  46  64
9  10  23  64

## Set index to start from 1 instead of 0

The default value of index is 0. To make it 1 just simply add 1 to the index.

In [4]:
df.index += 1

## Change index and to_datetime

Use to_datetime to convert the 'time' column to pandas's time format and set the index of dataframe to the column that records the time of data.

In [5]:
df = pd.DataFrame([['2017-01-01', 253, 234], ['2017-02-04', 283, 333], ['2017-02-11', 3, 55]], columns=['time', 'data1', 'data2'])
df

         time  data1  data2
0  2017-01-01    253    234
1  2017-02-04    283    333
2  2017-02-11      3     55

In [6]:
df.index = pd.to_datetime(df.pop('time'))
df

            data1  data2
time
2017-01-01    253    234
2017-02-04    283    333
2017-02-11      3     55

## Change the order of columns

In [7]:
df = pd.DataFrame(np.random.randint(0,100,size=(3, 4)), columns=list('ABCD'))
df

    A   B   C   D
0  48  79  17  21
1  43  16  35  21
2  88  53  81  94

In [8]:
df = df[["B", "D", "A", "C"]]
df

    B   D   A   C
0  79  21  48  17
1  16  21  43  35
2  53  94  88  81